app/controllers/available_time_slots_controller.rb

SELECT "available_time_slots".* FROM "available_time_slots"
---
  def index
    @timeslots = AvailableTimeSlot.all

INSERT INTO "available_time_slots" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-12-14 12:10:46.055388"], ["updated_at", "2018-12-14 12:10:46.055388"]]
---
  def create
    @timeslot = AvailableTimeSlot.new(timeslot_params)
      if @timeslot.save

SELECT  "available_time_slots".* FROM "available_time_slots" WHERE "available_time_slots"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
      @timeslot = AvailableTimeSlot.find(params[:id])