app/controllers/home_controller.rb

SELECT "tracks".* FROM "tracks"
---
  def index
    @timeslots = AvailableTimeSlot.all
    @tracks = Track.all
    @city_options = Track.all.map { |c| [c.city, c.id] }